opensupport-dev/nRF52DK-SDK_17.0.0-ble-app-uart-passkey-buzzer-batt/main.c
    err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    ret_code_t err_code;

    //err_code = nrf_ble_lesc_request_handler();  //freeNanum
    //APP_ERROR_CHECK(err_code);

    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}

void gpio_init(void)
{
  nrf_gpio_cfg_output(APP_LED_1);
  nrf_gpio_pin_set(APP_LED_1);
  nrf_gpio_cfg_input(APP_BTN_1,NRF_GPIO_PIN_PULLUP);
}

#if defined(BOARD_FREENANUM_V1)
static uint32_t pressed_time, released_time, pressed_duration = 0;
static bool pressed_cnt= false;
static bool over5sec_cnt = true; //When at first, trying to connect.
#endif

static uint32_t app_button_duration(void)
{
  pressed_duration = (released_time - pressed_time)*2; //ms
  return pressed_duration;
}

static void app_button_init_time_variable(void)
{
  pressed_duration = 0;
  //released_time = 0;
  //pressed_time = 0;
}

static void advertising_start(bool erase_bonds);

static void do_advertising_start_over_5sec(void)
{
  NRF_LOG_INFO("Advertising_start...");
  advertising_start(false);
}

static void do_delete_disconnect_over_5sec(void)
{
  NRF_LOG_INFO("Delete_disconnect...");
  advertising_start(true);
}

static void app_button_event_generator(void)
{
  if ((pressed_duration >= 2000) && (pressed_duration < 5000) ){ //over 2sec
    // Do something
    NRF_LOG_INFO("Button pressed for 2sec...");

  }else if((pressed_duration >= 5000) && (pressed_duration < 10000)){ //over 5sec
    NRF_LOG_INFO("Button pressed for 5sec...");

    /*
    if (over5sec_cnt){      
      //do_advertising_start_over_5sec();
      over5sec_cnt = false;
    }
    else{
      do_delete_disconnect_over_5sec();
      over5sec_cnt = true;
    }
    */
    
    //do_delete_disconnect_over_5sec();
  }
  
  app_button_init_time_variable();
}

static void app_button_event_handler(uint8_t pin_no, uint8_t button_action)
{
    ret_code_t err_code;

    switch (pin_no)
    {
      case APP_BTN_1:
        switch (button_action)
        {
          case APP_BUTTON_PUSH:
          {
            NRF_LOG_INFO("Button pressed...");
            nrf_gpio_pin_clear(APP_LED_1);
            
            pressed_time = app_timer_cnt_get()*1000/32768;//milli-sec
            NRF_LOG_INFO("pressed_time: %d", (int)pressed_time);
            pressed_cnt = true;
        
          } break;

           case APP_BUTTON_RELEASE:
           {  
              NRF_LOG_INFO("Button releaed...");
              nrf_gpio_pin_set(APP_LED_1);
              
              //if (pressed_cnt)
              {
                released_time = app_timer_cnt_get()*1000/32768; //milli-sec
                NRF_LOG_INFO("released_time: %d", (int)released_time);
              }

              pressed_cnt = false;
                
           } break;
        } 
      break;

      default:
         APP_ERROR_HANDLER(pin_no);
      break;
    }

    if(app_button_duration())
    {
      app_button_event_generator();
    }

    app_button_init_time_variable();
    
}

static void app_buttons_init(void)
{
  uint32_t err_code;

  static const app_button_cfg_t freenanum_app_buttons[BUTTONS_NUMBER] =
  {
#ifdef BOARD_FREENANUM_V1
    #ifdef APP_BTN_1
    {APP_BTN_1, false, BUTTON_PULL, app_button_event_handler},
    #endif // APP_BTN_1
#else
    #ifdef BSP_BUTTON_0
    {BSP_BUTTON_0, false, BUTTON_PULL, bsp_button_event_handler},
    #endif // BUTTON_0

    #ifdef BSP_BUTTON_1
    {BSP_BUTTON_1, false, BUTTON_PULL, bsp_button_event_handler},
    #endif // BUTTON_1

    #ifdef BSP_BUTTON_2
    {BSP_BUTTON_2, false, BUTTON_PULL, bsp_button_event_handler},
    #endif // BUTTON_2

    #ifdef BSP_BUTTON_3
    {BSP_BUTTON_3, false, BUTTON_PULL, bsp_button_event_handler},
    #endif // BUTTON_3

    #ifdef BSP_BUTTON_4
    {BSP_BUTTON_4, false, BUTTON_PULL, bsp_button_event_handler},
    #endif // BUTTON_4

    #ifdef BSP_BUTTON_5
    {BSP_BUTTON_5, false, BUTTON_PULL, bsp_button_event_handler},
    #endif // BUTTON_5

    #ifdef BSP_BUTTON_6
    {BSP_BUTTON_6, false, BUTTON_PULL, bsp_button_event_handler},
    #endif // BUTTON_6

    #ifdef BSP_BUTTON_7
    {BSP_BUTTON_7, false, BUTTON_PULL, bsp_button_event_handler},
    #endif // BUTTON_7
#endif
  };

  err_code = app_button_init((app_button_cfg_t *)freenanum_app_buttons,
                                       BUTTONS_NUMBER,
                                       APP_TIMER_TICKS(50));
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
    ret_code_t err_code;

    pm_handler_on_pm_evt(p_evt);
    pm_handler_disconnect_on_sec_failure(p_evt);
    pm_handler_flash_clean(p_evt);

    switch (p_evt->evt_id)
    {
        case PM_EVT_CONN_SEC_SUCCEEDED:
        {
            pm_conn_sec_status_t conn_sec_status;

            // Check if the link is authenticated (meaning at least MITM).
            err_code = pm_conn_sec_status_get(p_evt->conn_handle, &conn_sec_status);
            APP_ERROR_CHECK(err_code);

            if (conn_sec_status.mitm_protected)
            {
                NRF_LOG_INFO("Link secured. Role: %d. conn_handle: %d, Procedure: %d",
                             ble_conn_state_role(p_evt->conn_handle),
                             p_evt->conn_handle,
                             p_evt->params.conn_sec_succeeded.procedure);
            }
            else
            {
                // The peer did not use MITM, disconnect.
                NRF_LOG_INFO("Collector did not use MITM, disconnecting");
                err_code = pm_peer_id_get(m_conn_handle, &m_peer_to_be_deleted);
                APP_ERROR_CHECK(err_code);
                err_code = sd_ble_gap_disconnect(m_conn_handle,
                                                 BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                APP_ERROR_CHECK(err_code);
            }
        } break;

        case PM_EVT_CONN_SEC_FAILED:
            m_conn_handle = BLE_CONN_HANDLE_INVALID;
            break;

